WayBetterSolutions/OCTAVE/src/managers/esp32volumemanager.cpp
/*
 * ESP32 Volume Manager for OCTAVE (C++ port)
 * Handles USB Serial connection to ESP32-S3 receiver dongle for volume control.
 * The ESP32-S3 receives commands from a remote ESP32 encoder via ESP-NOW.
 *
 * Text protocol:
 *   '+' or '+N'  — volume up (N ticks)
 *   '-' or '-N'  — volume down (N ticks)
 *   'M'          — mute toggle (encoder button press)
 *
 * Sends to ESP32:
 *   'V##\n'        — volume level (0-100) for LED ring
 *   'M0\n' / 'M1\n' — mute state
 *   'C###,###,###\n' — RGB theme color
 */

#include "esp32volumemanager.h"
#include "settingsmanager.h"

#include <QVariant>

#include <QCoreApplication>
#include <QJsonArray>
#include <QJsonDocument>
#include <QJsonObject>
#include <QLoggingCategory>

Q_LOGGING_CATEGORY(lcEsp32, "octave.esp32volume")

// ==================== Construction / Destruction ====================

ESP32VolumeManager::ESP32VolumeManager(SettingsManager *settingsManager, QObject *parent)
    : QObject(parent)
    , m_settingsManager(nullptr)
    , m_serialPort(nullptr)
    , m_connected(false)
    , m_connectionStatus(QStringLiteral("Disconnected"))
    , m_connectionDetail(QStringLiteral("Not connected"))
    , m_stepSize(1.0)
    , m_reconnectDelay(3000)
    , m_reconnectAttempts(0)
    , m_maxReconnectAttempts(5)
    , m_pendingVolume(0)
    , m_hasPendingVolume(false)
{
    // Reconnect timer
    m_reconnectTimer.setSingleShot(true);
    connect(&m_reconnectTimer, &QTimer::timeout, this, &ESP32VolumeManager::onReconnectTimeout);

    // Port scanner timer (background scanning when disconnected)
    m_scanTimer.setInterval(10000);
    connect(&m_scanTimer, &QTimer::timeout, this, &ESP32VolumeManager::onScanTimeout);

    // Startup timer — delay initial connection
    m_startupTimer.setSingleShot(true);
    m_startupTimer.setInterval(3000);
    connect(&m_startupTimer, &QTimer::timeout, this, &ESP32VolumeManager::onStartupTimeout);

    // Volume update rate limiting to prevent LED flickering
    m_volumeSendTimer.setSingleShot(true);
    m_volumeSendTimer.setInterval(50); // 50ms debounce = max 20 updates/sec
    connect(&m_volumeSendTimer, &QTimer::timeout, this, &ESP32VolumeManager::onVolumeSendTimeout);

    // Keepalive timer — sends periodic volume updates to prevent ESP32 timeout
    m_keepaliveTimer.setInterval(2000); // Every 2 seconds (ESP32 timeout is 5s)
    connect(&m_keepaliveTimer, &QTimer::timeout, this, &ESP32VolumeManager::onKeepaliveTimeout);

    // Connect to settings if provided
    if (settingsManager) {
        connect_settings_manager(settingsManager);
    }
}

ESP32VolumeManager::~ESP32VolumeManager()
{
    cleanup();
}

// ==================== Settings Manager ====================

void ESP32VolumeManager::connect_settings_manager(SettingsManager *settingsManager)
{
    if (m_settingsManager)
        return;
    m_settingsManager = settingsManager;
    connectSettingsSignals();
    m_startupTimer.start();
}

void ESP32VolumeManager::connectSettingsSignals()
{
    if (!m_settingsManager)
        return;

    // These connect to signals that SettingsManager must declare.
    // The slot names match the Python signal names exactly.
    connect(m_settingsManager, SIGNAL(esp32VolumePortChanged()),
            this, SLOT(onPortChanged()));
    connect(m_settingsManager, SIGNAL(esp32VolumeEnabledChanged()),
            this, SLOT(onEnabledChanged()));
    connect(m_settingsManager, SIGNAL(esp32VolumeStepSizeChanged()),
            this, SLOT(onStepSizeChanged()));
    connect(m_settingsManager, SIGNAL(esp32AutoReconnectChanged()),
            this, SLOT(onAutoReconnectChanged()));
    connect(m_settingsManager, SIGNAL(esp32LedSleepEnabledChanged()),
            this, SLOT(onLedSleepChanged()));

    // Load initial step size via property or method — we use dynamic property
    // access so we don't need to include the full SettingsManager header.
    QVariant stepVar = m_settingsManager->property("esp32VolumeStepSize");
    if (stepVar.isValid())
        m_stepSize = stepVar.toDouble();
}

// ==================== Platform Detection ====================

QString ESP32VolumeManager::detectPlatform() const
{
#if defined(Q_OS_WIN)
    return QStringLiteral("windows");
#elif defined(Q_OS_MACOS)
    return QStringLiteral("macos");
#else
    return QStringLiteral("linux");
#endif
}

// ==================== Device Discovery ====================

QStringList ESP32VolumeManager::scanForDevices()
{
    QStringList ports;
    m_esp32S3Port.clear();

    const auto portInfos = QSerialPortInfo::availablePorts();

    // OBD port to exclude
    QString obdPort;
    if (m_settingsManager) {
        QVariant v = m_settingsManager->property("obdBluetoothPort");
        if (v.isValid())
            obdPort = v.toString();
    }

    for (const QSerialPortInfo &info : portInfos) {
        const QString desc = info.description().toLower();
        const QString portName = info.portName();
        const QString systemLocation = info.systemLocation();

        // Skip OBD port
        if (!obdPort.isEmpty() && systemLocation == obdPort)
            continue;

        // Check for ESP32-S3 (Espressif VID = 0x303A)
        bool isEsp32S3 = false;
        if (info.vendorIdentifier() == 0x303A) {
            isEsp32S3 = true;
        } else if (desc.contains(QStringLiteral("jtag"))
                   || desc.contains(QStringLiteral("esp32-s3"))
                   || desc.contains(QStringLiteral("esp32s3"))) {
            isEsp32S3 = true;
        }

        if (isEsp32S3) {
            ports.prepend(systemLocation);
            m_esp32S3Port = systemLocation;
            qCInfo(lcEsp32) << "detected ESP32-S3 on" << systemLocation;
        } else {
            // Accept common USB-serial chips
            bool isUsbSerial = desc.contains(QStringLiteral("cp210"))
                || desc.contains(QStringLiteral("ch340"))
                || desc.contains(QStringLiteral("ch910"))
                || desc.contains(QStringLiteral("ftdi"))
                || desc.contains(QStringLiteral("usb serial"))
                || desc.contains(QStringLiteral("silicon labs"))
                || desc.contains(QStringLiteral("prolific"));

            if (isUsbSerial || !systemLocation.isEmpty()) {
                ports.append(systemLocation);
            }
        }
    }

    ports.removeDuplicates();
    ports.sort();

    // Convert to QVariantList for comparison / emission
    QVariantList portsList;
    for (const QString &p : ports)
        portsList.append(p);

    if (portsList != m_availablePorts) {
        m_availablePorts = portsList;
        emit availablePortsChanged(m_availablePorts);
        qCDebug(lcEsp32) << "discovered ports:" << ports;
    }

    return ports;
}

// ==================== Settings Change Handlers ====================

