WayBetterSolutions/OCTAVE/src/managers/esp32volumemanager.cpp
void ESP32VolumeManager::onPortChanged()
{
    if (!m_settingsManager)
        return;
    QString newPort = m_settingsManager->property("esp32VolumePort").toString();
    qCInfo(lcEsp32) << "port changed to" << newPort;

    QVariant enabledVar = m_settingsManager->property("esp32VolumeEnabled");
    if (enabledVar.toBool() && !newPort.isEmpty()) {
        disconnect_device();
        m_reconnectAttempts = 0;
        QTimer::singleShot(500, this, &ESP32VolumeManager::connect_device);
    }
}

void ESP32VolumeManager::onEnabledChanged()
{
    if (!m_settingsManager)
        return;
    bool enabled = m_settingsManager->property("esp32VolumeEnabled").toBool();
    qCInfo(lcEsp32) << "enabled changed to" << enabled;
    if (enabled) {
        connect_device();
    } else {
        disconnect_device();
        m_scanTimer.stop();
    }
}

void ESP32VolumeManager::onStepSizeChanged()
{
    if (!m_settingsManager)
        return;
    m_stepSize = m_settingsManager->property("esp32VolumeStepSize").toDouble();
    qCDebug(lcEsp32) << "step size changed to" << m_stepSize;
}

void ESP32VolumeManager::onAutoReconnectChanged()
{
    if (!m_settingsManager)
        return;
    if (!m_settingsManager->property("esp32AutoReconnect").toBool()) {
        m_reconnectTimer.stop();
    }
}

void ESP32VolumeManager::onLedSleepChanged()
{
    if (!m_settingsManager)
        return;
    bool sleepEnabled = m_settingsManager->property("esp32LedSleepEnabled").toBool();
    qCInfo(lcEsp32) << "LED sleep setting changed to" << sleepEnabled;

    if (m_connected) {
        if (sleepEnabled) {
            m_keepaliveTimer.stop();
            qCInfo(lcEsp32) << "keepalive timer stopped (sleep enabled)";
        } else {
            m_keepaliveTimer.start();
            qCInfo(lcEsp32) << "keepalive timer started (sleep disabled)";
        }
    }
}

// ==================== Connection Management ====================

void ESP32VolumeManager::initialConnect()
{
    if (!m_settingsManager)
        return;

    scanForDevices();

    bool enabled = m_settingsManager->property("esp32VolumeEnabled").toBool();
    if (!enabled) {
        qCDebug(lcEsp32) << "disabled, skipping initial connection";
        return;
    }

    QString port = m_settingsManager->property("esp32VolumePort").toString();

    // Auto-select ESP32-S3 if detected and no port configured
    if (port.isEmpty() && !m_esp32S3Port.isEmpty()) {
        qCInfo(lcEsp32) << "auto-selecting ESP32-S3 on" << m_esp32S3Port;
        QMetaObject::invokeMethod(m_settingsManager, "save_esp32_volume_port",
                                  Q_ARG(QString, m_esp32S3Port));
        port = m_esp32S3Port;
    }
    // Fallback: try first available USB serial port
    else if (port.isEmpty() && !m_availablePorts.isEmpty()) {
        QString obdPort = m_settingsManager->property("obdBluetoothPort").toString();
        for (const QVariant &v : m_availablePorts) {
            QString p = v.toString();
            if (p != obdPort) {
                qCInfo(lcEsp32) << "auto-selecting port" << p;
                QMetaObject::invokeMethod(m_settingsManager, "save_esp32_volume_port",
                                          Q_ARG(QString, p));
                port = p;
                break;
            }
        }
    }

    if (!port.isEmpty()) {
        qCInfo(lcEsp32) << "starting initial connection...";
        connect_device();
    } else {
        qCInfo(lcEsp32) << "enabled but no port configured";
        m_connectionDetail = QStringLiteral("No port configured - select one above");
        emit connectionDetailChanged(m_connectionDetail);
    }
}

void ESP32VolumeManager::connect_device()
{
    qCInfo(lcEsp32) << "connect_device() called";

    {
        QMutexLocker locker(&m_lock);
        if (m_connected) {
            qCDebug(lcEsp32) << "already connected";
            return;
        }
    }

    if (!m_settingsManager) {
        qCWarning(lcEsp32) << "no settings manager!";
        return;
    }

    bool enabled = m_settingsManager->property("esp32VolumeEnabled").toBool();
    QString port = m_settingsManager->property("esp32VolumePort").toString();
    qCInfo(lcEsp32) << "enabled=" << enabled << "port=" << port;

    if (!enabled) {
        qCDebug(lcEsp32) << "disabled, not connecting";
        return;
    }

    if (port.isEmpty()) {
        m_connectionStatus = QStringLiteral("Not Configured");
        m_connectionDetail = QStringLiteral("No port configured");
        emit connectionStatusChanged(m_connectionStatus);
        emit connectionDetailChanged(m_connectionDetail);
        m_scanTimer.start();
        return;
    }

    m_connectionStatus = QStringLiteral("Connecting");
    m_connectionDetail = QStringLiteral("Connecting to %1...").arg(port);
    emit connectionStatusChanged(m_connectionStatus);
    emit connectionDetailChanged(m_connectionDetail);

    // Create serial port
    if (m_serialPort) {
        m_serialPort->close();
        m_serialPort->deleteLater();
        m_serialPort = nullptr;
    }

    m_serialPort = new QSerialPort(this);
    m_serialPort->setPortName(port);
    m_serialPort->setBaudRate(115200);
    m_serialPort->setDataBits(QSerialPort::Data8);
    m_serialPort->setParity(QSerialPort::NoParity);
    m_serialPort->setStopBits(QSerialPort::OneStop);
    m_serialPort->setFlowControl(QSerialPort::NoFlowControl);

    connect(m_serialPort, &QSerialPort::readyRead,
            this, &ESP32VolumeManager::onSerialReadyRead);
    connect(m_serialPort, &QSerialPort::errorOccurred,
            this, &ESP32VolumeManager::onSerialError);

    if (!m_serialPort->open(QIODevice::ReadWrite)) {
        qCWarning(lcEsp32) << "connection failed:" << m_serialPort->errorString();
        {
            QMutexLocker locker(&m_lock);
            m_connected = false;
        }
        m_connectionStatus = QStringLiteral("Error");
        m_connectionDetail = QStringLiteral("Connection failed: %1").arg(m_serialPort->errorString());
        emit connectionStatusChanged(m_connectionStatus);
        emit connectionDetailChanged(m_connectionDetail);
        scheduleReconnect();
        return;
    }

    {
        QMutexLocker locker(&m_lock);
        m_connected = true;
    }

