WayBetterSolutions/OCTAVE/src/managers/esp32volumemanager.cpp
    m_connectionStatus = QStringLiteral("Connected");
    m_connectionDetail = QStringLiteral("Connected to ESP32 on %1").arg(port);
    emit connectionStatusChanged(m_connectionStatus);
    emit connectionDetailChanged(m_connectionDetail);
    qCInfo(lcEsp32) << "connected to" << port;

    m_reconnectAttempts = 0;
    m_readBuffer.clear();

    // Start keepalive (only if sleep is disabled)
    bool sleepEnabled = m_settingsManager
        ? m_settingsManager->property("esp32LedSleepEnabled").toBool()
        : false;
    if (!sleepEnabled) {
        m_keepaliveTimer.start();
        qCInfo(lcEsp32) << "keepalive timer started (sleep disabled)";
    } else {
        qCInfo(lcEsp32) << "keepalive timer NOT started (sleep enabled)";
    }

    // Stop scanning while connected
    m_scanTimer.stop();
}

void ESP32VolumeManager::disconnect_device()
{
    qCInfo(lcEsp32) << "disconnecting...";

    m_reconnectTimer.stop();
    m_keepaliveTimer.stop();

    if (m_serialPort) {
        m_serialPort->close();
        m_serialPort->deleteLater();
        m_serialPort = nullptr;
    }

    {
        QMutexLocker locker(&m_lock);
        m_connected = false;
    }

    m_connectionStatus = QStringLiteral("Disconnected");
    m_connectionDetail = QStringLiteral("Disconnected from ESP32");
    emit connectionStatusChanged(m_connectionStatus);
    emit connectionDetailChanged(m_connectionDetail);
}

void ESP32VolumeManager::scheduleReconnect()
{
    if (!m_settingsManager)
        return;

    if (!m_settingsManager->property("esp32AutoReconnect").toBool()) {
        qCDebug(lcEsp32) << "auto-reconnect disabled";
        m_scanTimer.start();
        return;
    }

    if (m_reconnectAttempts >= m_maxReconnectAttempts) {
        qCWarning(lcEsp32) << "max reconnect attempts (" << m_maxReconnectAttempts << ") reached";
        m_connectionDetail = QStringLiteral("Max retries reached. Check connection.");
        emit connectionDetailChanged(m_connectionDetail);
        m_scanTimer.start();
        return;
    }

    m_reconnectAttempts++;
    int delay = qMin(10000, m_reconnectDelay * m_reconnectAttempts);

    qCInfo(lcEsp32) << "scheduling reconnect in" << delay << "ms (attempt"
                     << m_reconnectAttempts << "/" << m_maxReconnectAttempts << ")";
    m_connectionDetail = QStringLiteral("Reconnecting in %1s... (%2/%3)")
        .arg(delay / 1000)
        .arg(m_reconnectAttempts)
        .arg(m_maxReconnectAttempts);
    emit connectionDetailChanged(m_connectionDetail);

    m_reconnectTimer.setInterval(delay);
    m_reconnectTimer.start();
}

void ESP32VolumeManager::attemptReconnect()
{
    if (m_connected)
        return;
    qCInfo(lcEsp32) << "attempting reconnect...";
    connect_device();
}

void ESP32VolumeManager::handleDisconnect()
{
    {
        QMutexLocker locker(&m_lock);
        if (!m_connected)
            return;
        m_connected = false;
    }

    m_connectionStatus = QStringLiteral("Disconnected");
    m_connectionDetail = QStringLiteral("Connection lost");
    emit connectionStatusChanged(m_connectionStatus);
    emit connectionDetailChanged(m_connectionDetail);

    qCWarning(lcEsp32) << "connection lost, scheduling reconnect";
    scheduleReconnect();
}

// ==================== Serial I/O ====================

void ESP32VolumeManager::onSerialReadyRead()
{
    if (!m_serialPort)
        return;

    QByteArray data = m_serialPort->readAll();
    m_readBuffer.append(QString::fromUtf8(data));

    // Process complete lines
    while (m_readBuffer.contains(QLatin1Char('\n'))) {
        int idx = m_readBuffer.indexOf(QLatin1Char('\n'));
        QString line = m_readBuffer.left(idx).trimmed();
        m_readBuffer = m_readBuffer.mid(idx + 1);
        if (!line.isEmpty()) {
            processCommand(line);
        }
    }
}

void ESP32VolumeManager::onSerialError(QSerialPort::SerialPortError error)
{
    if (error == QSerialPort::NoError)
        return;

    // ResourceError typically means the device was unplugged
    if (error == QSerialPort::ResourceError) {
        qCWarning(lcEsp32) << "serial resource error (device unplugged?)";
        handleDisconnect();
    } else {
        qCWarning(lcEsp32) << "serial error:" << error;
    }
}

void ESP32VolumeManager::processCommand(const QString &command)
{
    QString cmd = command.trimmed().toUpper();
    qCDebug(lcEsp32) << "received command:" << cmd;

    if (cmd == QLatin1String("+")) {
        // Single tick clockwise
        emit volumeChangeRequested(static_cast<float>(m_stepSize));
    } else if (cmd == QLatin1String("-")) {
        // Single tick counter-clockwise
        emit volumeChangeRequested(static_cast<float>(-m_stepSize));
    } else if (cmd.startsWith(QLatin1Char('+')) && cmd.length() > 1) {
        // Multiple ticks clockwise: +3
        bool ok = false;
        int ticks = cmd.mid(1).toInt(&ok);
        if (ok) {
            emit volumeChangeRequested(static_cast<float>(m_stepSize * ticks));
        } else {
            qCWarning(lcEsp32) << "invalid command format:" << cmd;
        }
    } else if (cmd.startsWith(QLatin1Char('-')) && cmd.length() > 1) {
        // Multiple ticks counter-clockwise: -2
        bool ok = false;
        int ticks = cmd.mid(1).toInt(&ok);
        if (ok) {
            emit volumeChangeRequested(static_cast<float>(-m_stepSize * ticks));
        } else {
            qCWarning(lcEsp32) << "invalid command format:" << cmd;
        }
    } else if (cmd == QLatin1String("M")) {
        // Mute toggle (encoder button press)
        emit muteToggleRequested();
    } else if (cmd == QLatin1String("P")) {
        // Play/pause (optional - double-click)
        qCDebug(lcEsp32) << "play/pause command (not implemented)";
    } else {
        qCDebug(lcEsp32) << "unknown command:" << cmd;
    }
}

// ==================== Public Slots for QML ====================

QVariantList ESP32VolumeManager::get_available_ports()
{
    scanForDevices();
    return m_availablePorts;
}

QString ESP32VolumeManager::get_ports_with_descriptions()
{
    QJsonArray portsArray;
    QString obdPort;
    if (m_settingsManager)
        obdPort = m_settingsManager->property("obdBluetoothPort").toString();

    const auto portInfos = QSerialPortInfo::availablePorts();
    for (const QSerialPortInfo &info : portInfos) {
        QString device = info.systemLocation();

        // Skip OBD port
        if (device == obdPort)
            continue;

        QString desc = info.description();
        if (desc.isEmpty())
            desc = QStringLiteral("Unknown Device");

        // Identify ESP32-S3
        bool isEsp32S3 = (info.vendorIdentifier() == 0x303A)
            || desc.toLower().contains(QStringLiteral("jtag"))
            || desc.toLower().contains(QStringLiteral("esp32-s3"));

        // Build display label
        QString label;
        if (isEsp32S3) {
            label = QStringLiteral("%1 - ESP32-S3 (Recommended)").arg(device);
        } else {
            label = QStringLiteral("%1 - %2").arg(device, desc);
        }

