WayBetterSolutions/OCTAVE/src/managers/esp32volumemanager.cpp
        QJsonObject obj;
        obj[QStringLiteral("port")] = device;
        obj[QStringLiteral("label")] = label;
        obj[QStringLiteral("description")] = desc;
        obj[QStringLiteral("isEsp32S3")] = isEsp32S3;
        portsArray.append(obj);
    }

    // Sort: ESP32-S3 first, then by port name
    // QJsonArray doesn't support in-place sort, so we sort via a QList
    QList<QJsonObject> sorted;
    for (const QJsonValue &v : portsArray)
        sorted.append(v.toObject());
    std::sort(sorted.begin(), sorted.end(), [](const QJsonObject &a, const QJsonObject &b) {
        bool aEsp = a[QStringLiteral("isEsp32S3")].toBool();
        bool bEsp = b[QStringLiteral("isEsp32S3")].toBool();
        if (aEsp != bEsp)
            return aEsp; // ESP32-S3 first
        return a[QStringLiteral("port")].toString() < b[QStringLiteral("port")].toString();
    });

    QJsonArray sortedArray;
    for (const QJsonObject &obj : sorted)
        sortedArray.append(obj);

    return QString::fromUtf8(QJsonDocument(sortedArray).toJson(QJsonDocument::Compact));
}

bool ESP32VolumeManager::is_connected()
{
    return m_connected;
}

QString ESP32VolumeManager::get_connection_status()
{
    return m_connectionStatus;
}

QString ESP32VolumeManager::get_connection_detail()
{
    return m_connectionDetail;
}

void ESP32VolumeManager::refresh_ports()
{
    scanForDevices();
}

void ESP32VolumeManager::reset_reconnect_attempts()
{
    m_reconnectAttempts = 0;
}

// ==================== Properties ====================

bool ESP32VolumeManager::getConnected() const
{
    return m_connected;
}

QString ESP32VolumeManager::getConnectionStatusProp() const
{
    return m_connectionStatus;
}

QString ESP32VolumeManager::getConnectionDetailProp() const
{
    return m_connectionDetail;
}

QVariantList ESP32VolumeManager::getAvailablePortsProp() const
{
    return m_availablePorts;
}

// ==================== Send Commands to ESP32 ====================

void ESP32VolumeManager::send_volume_update(int volume)
{
    if (!m_connected || !m_serialPort)
        return;

    m_pendingVolume = volume;
    m_hasPendingVolume = true;

    if (!m_volumeSendTimer.isActive())
        m_volumeSendTimer.start();
}

void ESP32VolumeManager::sendPendingVolume()
{
    if (!m_hasPendingVolume)
        return;

    if (!m_connected || !m_serialPort) {
        m_hasPendingVolume = false;
        return;
    }

    QString cmd = QStringLiteral("V%1\n").arg(m_pendingVolume);
    qCInfo(lcEsp32) << "sending volume command:" << cmd.trimmed();
    m_serialPort->write(cmd.toUtf8());
    m_hasPendingVolume = false;
}

void ESP32VolumeManager::sendKeepalive()
{
    if (!m_connected || !m_serialPort)
        return;

    if (m_settingsManager) {
        QVariant volVar = m_settingsManager->property("currentVolume");
        int volume = volVar.isValid() ? volVar.toInt() : 50;
        QString cmd = QStringLiteral("V%1\n").arg(volume);
        m_serialPort->write(cmd.toUtf8());
        // Don't log keepalives to avoid spam
    }
}

void ESP32VolumeManager::send_mute_state(bool muted)
{
    if (!m_connected || !m_serialPort) {
        qCInfo(lcEsp32) << "send_mute_state(" << muted << ") - not connected, skipping";
        return;
    }

    QString cmd = QStringLiteral("M%1\n").arg(muted ? 1 : 0);
    qCInfo(lcEsp32) << "sending mute command:" << cmd.trimmed();
    m_serialPort->write(cmd.toUtf8());
}

void ESP32VolumeManager::send_theme_color(int r, int g, int b)
{
    if (!m_connected || !m_serialPort) {
        qCInfo(lcEsp32) << "send_theme_color(" << r << g << b << ") - not connected, skipping";
        return;
    }

    QString cmd = QStringLiteral("C%1,%2,%3\n").arg(r).arg(g).arg(b);
    qCInfo(lcEsp32) << "sending color command:" << cmd.trimmed();
    m_serialPort->write(cmd.toUtf8());
    qCDebug(lcEsp32) << "sent theme color: RGB(" << r << g << b << ")";
}

// ==================== Timer Slots ====================

void ESP32VolumeManager::onReconnectTimeout()
{
    attemptReconnect();
}

void ESP32VolumeManager::onScanTimeout()
{
    scanForDevices();
}

void ESP32VolumeManager::onStartupTimeout()
{
    initialConnect();
}

void ESP32VolumeManager::onVolumeSendTimeout()
{
    sendPendingVolume();
}

void ESP32VolumeManager::onKeepaliveTimeout()
{
    sendKeepalive();
}

// ==================== Cleanup ====================

void ESP32VolumeManager::cleanup()
{
    qCInfo(lcEsp32) << "cleaning up...";
    m_reconnectTimer.stop();
    m_scanTimer.stop();
    m_startupTimer.stop();
    m_volumeSendTimer.stop();
    m_keepaliveTimer.stop();
    disconnect_device();
}
